package com.dvc.constants;

import java.io.IOException;
import java.util.Arrays;
import java.util.List;
import java.util.Map;

import com.dvc.models.ComboData;
import com.fasterxml.jackson.databind.ObjectMapper;

public class CommonConstants {
        // public static List<String> HEADERS = Arrays.asList("serialno",
        // "recipientsname", "nameicpp", "gender",
        //
        // ob", "nric", "passport", "nationality", "organization",
        //
        //
        // "division", "township", "address1", "remark");
        //
        public static List<String> STATE = Arrays.asList(
                        "\u1000\u1001\u103B\u1004\u103A\u1015\u103C\u100A\u103A\u1014\u101A\u103A",
                        "\u1000\u101A\u102C\u1038\u1015\u103C\u100A\u103A\u1014\u101A\u103A",
                        "\u1000\u101B\u1004\u103A\u1015\u103C\u100A\u103A\u1014\u101A\u103A",
                        "\u1001\u103B\u1004\u103A\u1038\u1015\u103C\u100A\u103A\u1014\u101A\u103A",
                        "\u1005\u1005\u103A\u1000\u102D\u102F\u1004\u103A\u1038\u1010\u102D\u102F\u1004\u103A\u1038",
                        "\u1010\u1014\u1004\u103A\u1039\u101E\u102C\u101B\u102E\u1010\u102D\u102F\u1004\u103A\u1038",
                        "\u1015\u1032\u1001\u1030\u1038\u1010\u102D\u102F\u1004\u103A\u1038",
                        "\u1019\u1000\u103D\u1031\u1038\u1010\u102D\u102F\u1004\u103A\u1038",
                        "\u1019\u1014\u1039\u1010\u101C\u1031\u1038\u1010\u102D\u102F\u1004\u103A\u1038",
                        "\u1019\u103D\u1014\u103A\u1015\u103C\u100A\u103A\u1014\u101A\u103A",
                        "\u101B\u1001\u102D\u102F\u1004\u103A\u1015\u103C\u100A\u103A\u1014\u101A\u103A",
                        "\u101B\u1014\u103A\u1000\u102F\u1014\u103A\u1010\u102D\u102F\u1004\u103A\u1038",
                        "\u101B\u103E\u1019\u103A\u1038\u1015\u103C\u100A\u103A\u1014\u101A\u103A",
                        "\u1027\u101B\u102C\u101D\u1010\u102E\u1010\u102D\u102F\u1004\u103A\u1038",

                        "\u1014\u1031\u1015\u103c\u100a\u103a\u1010\u1031\u102c\u103a",
                        "\u101B\u103E\u1019\u103A\u1038\u1015\u103C\u100A\u103A\u1014\u101A\u103A (\u1010\u1031\u102c\u1004\u103a\u1015\u102d\u102f\u1004\u103a\u1038)",
                        "\u101B\u103E\u1019\u103A\u1038\u1015\u103C\u100A\u103A\u1014\u101A\u103A (\u1019\u103c\u1031\u102c\u1000\u103a\u1015\u102d\u102f\u1004\u103a\u1038)");
        public static List<String> HEADERS = Arrays.asList("serialno", "recipientname", "gener", "fathename", "dob",
                        "nricorpassport", "nationality", "organization", "mobilephone", "division", "township",
                        "address1", "remark");
        public static List<String> HEADERS_M = Arrays.asList("serialno", "recipientsname", "gender", "fathername",
                        "dob", "nric", "organization", "mobilephone", "division", "township", "address1", "remark");
        public static List<String> HEADERS_M_V2 = Arrays.asList("serialno", "recipientsname", "gender", "fathername",
                        "dob", "nric", "passport", "organization", "mobilephone", "division", "township", "address1",
                        "remark");
        public static List<String> HEADERS_F = Arrays.asList("serialno", "recipientsname", "gender", "fathername",
                        "dob", "passport", "nationality", "organization", "mobilephone", "division", "township",
                        "address1", "remark");

        public static List<ComboData> APPROVAL_LIST = Arrays.asList(

                        new ComboData("Uploaded", 1),

                        new ComboData("Verified", 10),

                        new ComboData("Submitted", 20),

                        new ComboData("Approved", 30),

                        new ComboData("Approved", 35)

        );

        public static List<ComboData> PAYMENT_LIST = Arrays.asList(

                        new ComboData("-", 0),

                        new ComboData("Processing", 1),

                        new ComboData("Paid", 10)

        );

        public static List<ComboData> VOID_LIST = Arrays.asList(

                        new ComboData("Unvoid", 1),

                        new ComboData("Void", 0)

        );

        public static List<String> HEADERS_MOHS = Arrays.asList("serialno", "recipientsname", "fathername", "dob",
                        "gender", "prefixnrc", "nrccode", "nrctype", "nrcno", "passport", "organization", "mobilephone",
                        "division", "township", "ward", "street", "occupation", "vaccinationcenter", "nationality");

        public static List<String> PREFIX_NRCS = Arrays.asList("ကချင်_၁", "ကယား_၂", "ကရင်_၃", "ချင်း_၄", "စစ်ကိုင်း_၅",
                        "တနင်္သာရီ_၆", "ပဲခူး_၇", "မကွေး_၈", "မန္တလေး_၉", "မွန်_၁၀", "ရခိုင်_၁၁", "ရန်ကုန်_၁၂",
                        "ရှမ်း_၁၃", "ဧရာဝတီ_၁၄");

        public static String NRC_CODE_JSON = "{\"ကချင်_၁\":[\"မကန\",\"‌ဆဘတ\",\"ဝမန\",\"ဆဒန\",\"အဂယ\",\"တနန\",\"ရဗယ\",\"ခဖန\",\"ဆလန\",\"ကပတ\",\"ပဝန\",\"မညန\",\"ဟပန\",\"မကတ\",\"ကမန\",\"ဖကန\",\"ကမတ\",\"ဗမန\",\"ရကန\",\"မလန\",\"မမန\",\"လဂန\",\"ဒဖယ\",\"မစန\",\"ပတအ\",\"မခဘ\",\"နမန\",\"ပနဒ\",\"ခဘဒ\",\"ခလဖ\",\"ဆပဘ\"],\"ကယား_၂\":[\"လကန\",\"ဒမဆ\",\"ဖရဆ\",\"ရတန\",\"ဘလခ\",\"ဖဆန\",\"မစန\",\"ရသန\"],\"ကရင်_၃\":[\"ဘအန\",\"လဘန\",\"ပကန\",\"ရရသ\",\"သတက\",\"သတန\",\"လသန\",\"ဘဂလ\",\"ဖပန\",\"ကမမ\",\"ကကရ\",\"ကဆက\",\"ကဒန\",\"ဘသဆ\",\"မဝတ\",\"စကလ\",\"ဝလမ\"],\"ချင်း_၄\":[\"ဟခန\",\"ထတလ\",\"ဖလန\",\"ရခဒ\",\"တတန\",\"တဇန\",\"ကခန\",\"မတန\",\"မတပ\",\"ရဇန\",\"ကပလ\",\"ပလဝ\",\"ဆမန\"],\"စစ်ကိုင်း_၅\":[\"စကန\",\"မမတ\",\"မမန\",\"ရဘန\",\"ဝလန\",\"ခဥန\",\"ကဘလ\",\"ကလန\",\"ရဥန\",\"ဒပယ\",\"တဆန\",\"ကမန\",\"မရန\",\"ခဥတ\",\"အရတ\",\"ဘတလ\",\"ယမပ\",\"ပလန\",\"ကနန\",\"ဆလက\",\"ကသန\",\"ထခန\",\"အတန\",\"ဗမန\",\"ကလတ\",\"ပလဘ\",\"ဝသန\",\"ကလထ\",\"ကလဝ\",\"မကန\",\"တမန\",\"ခပန\",\"မသန\",\"မလန\",\"ဖပန\",\"ခတန\",\"ဟမလ\",\"လရန\",\"လဟန\",\"နယန\",\"ပဆန\",\"ဒဟန\",\"မပလ\",\"ထပခ\",\"ဆမရ\",\"ငဇန\"],\"တနင်္သာရီ_၆\":[\"ထဝန\",\"လလန\",\"သရခ\",\"ရဖန\",\"မတန\",\"ကလအ\",\"မအရ\",\"မအန\",\"ကစန\",\"ပလန\",\"တသရ\",\"ပလတ\",\"ကသန\",\"ဘပန\",\"ခမက\",\"ပကမ\",\"ကရရ\",\"မမန\"],\"ပဲခူး_၇\":[\"တငန\",\"ရတရ\",\"ထတပ\",\"အတန\",\"ဖမန\",\"ကကန\",\"ပခန\",\"ကတခ\",\"ရကန\",\"ညလပ\",\"ဒဥန\",\"ဝမန\",\"သနပ\",\"ကဝန\",\"သဝတ\",\"လပတ\",\"မလန\",\"မညန\",\"အဖန\",\"ကပက\",\"ဇကန\",\"နတလ\",\"ပမန\",\"သကန\",\"ရတန\",\"ပတတ\",\"ပတန\",\"ပခတ\"],\"မကွေး_၈\":[\"မကန\",\"ရနခ\",\"ခမန\",\"နမန\",\"မသန\",\"တတက\",\"မဘန\",\"ပဖန\",\"စလန\",\"စတရ\",\"ငဖန\",\"သရန\",\"မထန\",\"အလန\",\"ကမန\",\"မတန\",\"ဆပဝ\",\"မလန\",\"ပခက\",\"ရစက\",\"မမန\",\"ပမန\",\"ဆဖန\",\"ဂဂန\",\"ဆမန\",\"ထလန\",\"ကထန\"],\"မန္တလေး_၉\":[\"မနမ\",\"အမဇ\",\"မရမ\",\"ခအဇ\",\"မနတ\",\"ခမစ\",\"မရတ\",\"မဟမ\",\"ပကခ\",\"အမရ\",\"ပသက\",\"မမန\",\"ပဥလ\",\"မတရ\",\"စကန\",\"သပက\",\"မကန\",\"တကတ\",\"ကဆန\",\"စကတ\",\"မသန\",\"တတဥ\",\"မခန\",\"တသန\",\"ကပတ\",\"နထက\",\"ညဥန\",\"ငဇန\",\"ငသရ\",\"မထလ\",\"မလန\",\"သစန\",\"ဝတန\",\"ရမသ\",\"ပဘန\",\"ဥတသ\",\"ဇယသ\",\"ပဗသ\",\"တကန\",\"ဒခသ\",\"ဇဘသ\",\"ပမန\",\"လဝန\"],\"မွန်_၁၀\":[\"မလမ\",\"ကမရ\",\"ခဆန\",\"သဖရ\",\"မဒန\",\"ရမန\",\"လမန\",\"ခဇန\",\"သထန\",\"ပမန\",\"ကထန\",\"ဘလန\"],\"ရခိုင်_၁၁\":[\"စတန\",\"ရသတ\",\"ပဏက\",\"ပတန\",\"မဥန\",\"မပန\",\"ကတန\",\"မပန\",\"မတန\",\"ဘသတ\",\"တပဝ\",\"ကဖန\",\"ရဗန\",\"မအန\",\"အမန\",\"သတန\",\"တကန\",\"မအတ\",\"ဂမန\",\"ကတလ\",\"ရဗန\"],\"ရန်ကုန်_၁၂\":[\"သဃက\",\"ရကန\",\"ဥကတ\",\"ဥကမ\",\"သကတ\",\"ဒပန\",\"တမန\",\"ပဇတ\",\"ဗတထ\",\"မဂတ\",\"ဒဂမ\",\"ဒဂရ\",\"ဒဂတ\",\"ဒဂဆ\",\"ကတတ\",\"ပဘတ\",\"လမတ\",\"လသန\",\"အလန\",\"ကမတ\",\"စခန\",\"လမန\",\"ကမရ\",\"မရက\",\"ဒဂန\",\"ဗဟန\",\"ဆကန\",\"သလန\",\"ကတန\",\"တတတ\",\"သခန\",\"ခရန\",\"တတန\",\"ကမန\",\"ကခက\",\"ဒလန\",\"ဆကခ\",\"ကကက\",\"အစန\",\"မဂဒ\",\"မဘန\",\"လကန\",\"တကန\",\"ထတပ\",\"ရပသ\",\"လသယ\",\"တတထ\"],\"ရှမ်း_၁၃\":[\"တကန\",\"ဟပန\",\"ညရန\",\"ဆဆန\",\"ကလန\",\"ပတယ\",\"ရငန\",\"ရစန\",\"ပလန\",\"ဖခန\",\"ကတလ\",\"နတရ\",\"အတန\",\"လလန\",\"လခန\",\"နစန\",\"ကဟန\",\"ကသန\",\"မကန\",\"မရန\",\"ပလတ\",\"မနတ\",\"ခလန\",\"ကလဒ\",\"မစန\",\"လခတ\",\"မနန\",\"မမန\",\"မပန\",\"ဟမန\",\"ကတတ\",\"လရန\",\"သနန\",\"တယန\",\"မရတ\",\"ကလတ\",\"ပယန\",\"နဖန\",\"မဖတ\",\"ပဆန\",\"မကထ\",\"မဆတ\",\"နခန\",\"ကခန\",\"တမည\",\"မဟရ\",\"မကတ\",\"ပဆတ\",\"ကမန\",\"သပန\",\"နခတ\",\"နမတ\",\"နဆန\",\"မတတ\",\"မငန\",\"မလတ\",\"မမတ\",\"မဘန\",\"ဟပတ\",\"ပဝန\",\"မမထ\",\"နတန\",\"ပလထ\",\"လကန\",\"ကကန\",\"ခရဟ\",\"မထတ\",\"ကတန\",\"မလန\",\"မယန\",\"မပထ\",\"မခန\",\"မပတ\",\"တတန\",\"မဆန\",\"မခတ\",\"မတန\",\"ပပက\",\"မထန\",\"မဖန\",\"မယတ\",\"မယထ\",\"တခလ\",\"တလန\",\"ကလထ\"],\"ဧရာဝတီ_၁၄\":[\"ပသန\",\"ရသယ\",\"ငဆန\",\"ပသရ\",\"ကကထ\",\"ငပတ\",\"ဟကက\",\"ငရက\",\"သပန\",\"ကကန\",\"ရကန\",\"ငသခ\",\"ကပန\",\"ဟသတ\",\"ဇလန\",\"လမန\",\"အဂပ\",\"မအန\",\"ကခန\",\"မအပ\",\"ပတန\",\"ညတန\",\"ဓနဖ\",\"ဖပန\",\"အမတ\",\"ဘကလ\",\"ကလန\",\"ဒဒရ\",\"လပတ\",\"ပစလ\",\"မမက\",\"မမန\",\"အမန\",\"ဝခမ\"]}";

        public static List<String> getNrcCodes(String prefixnrc) throws IOException {
                Map<String, Object> data = new ObjectMapper().readValue(NRC_CODE_JSON, Map.class);
                return (List<String>) data.get(prefixnrc);
        }

        public static List<String> NATIONALITY_CODES = Arrays.asList("နိုင်", "ပြု", "ဧည့်", "သ", "သီ", "စ");
}
